In [1]:
import pandas as pd

In [3]:
title_crew_path = "C:\\Users\\559816\\Documents\\Project2\\Projet-Data-IA\\Database\\movies_title_crew.csv"
df = pd.read_csv(title_crew_path, sep = ',')

In [4]:
df.head()

      tconst  directors                        writers
0  tt0000009  nm0085156                      nm0085156
1  tt0000147  nm0714557                            NaN
2  tt0000502  nm0063413  nm0063413,nm0657268,nm0675388
3  tt0000574  nm0846879                      nm0846879
4  tt0000591  nm0141150                      nm0141150

In [5]:
import numpy as np

df.replace(r'\N', np.nan, inplace=True)

df.head()

      tconst  directors                        writers
0  tt0000009  nm0085156                      nm0085156
1  tt0000147  nm0714557                            NaN
2  tt0000502  nm0063413  nm0063413,nm0657268,nm0675388
3  tt0000574  nm0846879                      nm0846879
4  tt0000591  nm0141150                      nm0141150

In [9]:
df = df.drop(columns = ['writers'])

In [7]:
df = df.dropna()

In [10]:
df.head()

      tconst  directors
0  tt0000009  nm0085156
2  tt0000502  nm0063413
3  tt0000574  nm0846879
4  tt0000591  nm0141150
5  tt0000615  nm0533958

In [11]:
# ready to export

df.to_csv('cleaned_movies_title_crew.csv', index=False)